Revit 2024 API
RenderingImageExposureSettings.Shadows Property
 The shadows value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double Shadows { get; set; }
Visual Basic
Public Property Shadows As Double
	Get
	Set
Visual C++
public:
property double Shadows {
	double get ();
	void set (double value);
}
Remarks
 Increase this value to get darker shadows.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The value of shadows is not valid. The valid range is 0.1 to 4.
See Also
RenderingImageExposureSettings Class
Autodesk.Revit.DB Namespace